УТ/src/Reports/АУ_ОтчетБалансПоЗаказу/АУ_ОтчетБалансПоЗаказу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АУ_ОтчетБалансПоЗаказу</name>
</mdclass:Report>

УТ/src/AccumulationRegisters/ДенежныеСредстваБезналичные/ДенежныеСредстваБезналичные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредстваБезналичные</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КЗачислению</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КСписанию</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПлатежаФЗ275</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлатежныйДокумент</name>
    <type>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЦелевыхСредств</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <dimensions>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ/src/Reports/АУ_ОтчетБалансПоЗаказу/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	МассивНазначений.Добавить("");
	
	ПараметрыРегистрации.Вставить("Вид", "ДополнительныйОтчет"); //может быть - ПечатнаяФорма, ЗаполнениеОбъекта, ДополнительныйОтчет, СозданиеСвязанныхОбъектов... 
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "Баланс по заказам (АУРУМ)"); //имя под которым обработка будет зарегестрирована в справочнике внешних обработок
	ПараметрыРегистрации.Вставить("БезопасныйРежим", ЛОЖЬ);
	ПараметрыРегистрации.Вставить("Версия", "1.0"); 
	ПараметрыРегистрации.Вставить("Информация", ""); 
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "Баланс по заказам (АУРУМ)", "АУ_ОтчетБалансПоЗаказу", "ОткрытиеФормы", Истина, "ПечатьMXL");
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);

	Возврат ПараметрыРегистрации;

КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));//как будет выглядеть описание печ.формы для пользователя
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); //имя макета печ.формы
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); //ВызовСерверногоМетода
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")

	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление; 
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;

КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	Рубли=Константы.ВалютаРегламентированногоУчета.Получить();
	
	ТЗ=Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Заказ");
	ТЗ.Колонки.Добавить("СуммаЗаказа",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("СуммаЗаказаРубли",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ЗадолженностьЗаказчика",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("СуммаДокумента",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ВалютаДокумента");
	ТЗ.Колонки.Добавить("СуммаЗаказаПоставщику",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("СуммаЗаказаПоставщикуРубли",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("СуммаАвансовогоОтчета",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("СуммаПоступленияТоваров",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("СуммаПриходаДенег",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("СуммаРасходаДенег",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("СуммаРасходаДенегВВалютеВзаиморасчетов",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("СуммаРасходаДенегРубли",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ДокументОперации");
	ТЗ.Колонки.Добавить("Контрагент");
	ТЗ.Колонки.Добавить("Приоритет",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("СуммаОперации",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ДатаОперации",Новый ОписаниеТипов("Дата"));
	ТЗ.Колонки.Добавить("ЗаказПоставщику",Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику"));
	ТЗ.Колонки.Добавить("ПоступлениеТоваров",Новый ОписаниеТипов("ДокументСсылка.ПриобретениеТоваровУслуг"));
	ТЗ.Колонки.Добавить("АвансовыйОтчет",Новый ОписаниеТипов("ДокументСсылка.ЗаказКлиента"));
	ТЗ.Колонки.Добавить("ДокументРасходаДенежныхСредств");
	ТЗ.Колонки.Добавить("ДокументПриходаДенежныхСредств");
	ТЗ.Колонки.Добавить("ЗадолженностьВВалютеВзаиморасчетов",Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("ЗадолженностьВРублях",Новый ОписаниеТипов("Число"));
	
	Параметр=КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Заказ");
	
	Заказ=Неопределено;
	
	Запрос=Новый Запрос;
	Если ЗначениеЗаполнено(Параметр.Значение) Тогда
		Запрос.УстановитьПараметр("Заказ",Параметр.Значение);
	Иначе
		Параметр=КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
		Если ЗначениеЗаполнено(Параметр.Значение) Тогда
			Запрос.УстановитьПараметр("Заказ",Параметр.Значение);
			Заказ=Параметр.Значение;
		Иначе
			Запрос.УстановитьПараметр("Заказ",Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	//1. Заказы клиентов
	Запрос.Текст="ВЫБРАТЬ
	             |	ЗаказКлиента.Ссылка КАК Заказ,
	             |	ЗаказКлиента.Ссылка КАК ДокументОперации,
	             |	ЗаказКлиента.Контрагент КАК Контрагент,
				 |	ЗаказКлиента.Дата КАК ДатаОперации,
				 |	ЗаказКлиента.Валюта КАК ВалютаДокумента,
	             |	СУММА(ЗаказКлиента.СуммаДокумента) КАК СуммаЗаказа,
	             |	СУММА(ЗаказКлиента.СуммаДокумента) КАК СуммаДокумента
	             |ИЗ
	             |	Документ.ЗаказКлиента КАК ЗаказКлиента
	             |ГДЕ
	             |	ЗаказКлиента.Проведен
	             |	И ВЫБОР
	             |			КОГДА &Заказ = НЕОПРЕДЕЛЕНО
	             |				ТОГДА ИСТИНА
	             |			ИНАЧЕ ЗаказКлиента.Ссылка = &Заказ
	             |		КОНЕЦ
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ЗаказКлиента.Ссылка,
	             |	ЗаказКлиента.Ссылка,
	             |	ЗаказКлиента.Контрагент";
	ТЗЗаказов=Запрос.Выполнить().Выгрузить();
	
	Для каждого стрТЗ Из ТЗЗаказов Цикл
		
		НоваяСтрока=ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,стрТЗ);
		
		НоваяСтрока.СуммаЗаказаРубли=РаботаСКурсамиВалют.ПересчитатьВВалюту(стрТЗ.СуммаДокумента,стрТЗ.ВалютаДокумента,Рубли,стрТЗ.ДатаОперации);
		НоваяСтрока.ЗадолженностьЗаказчика=НоваяСтрока.СуммаЗаказаРубли;
		
	КонецЦикла;
	
	//2. Заказы поставщикам
	Запрос.Текст="ВЫБРАТЬ
	             |	ВЫБОР
	             |		КОГДА ЗаказПоставщикуТовары.АУ_ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	             |			ТОГДА ЗаказПоставщикуТовары.Ссылка.ДокументОснование
	             |		ИНАЧЕ ЗаказПоставщикуТовары.АУ_ЗаказКлиента
	             |	КОНЕЦ КАК Заказ,
	             |	СУММА(ЗаказПоставщикуТовары.СуммаСНДС) КАК СуммаЗаказаПоставщику,
	             |	ЗаказПоставщикуТовары.Ссылка.СуммаДокумента КАК СуммаДокумента,
	             |	ЗаказПоставщикуТовары.Ссылка КАК ДокументОперации,
	             |	ЗаказПоставщикуТовары.Ссылка.Контрагент КАК Контрагент,
	             |	ЗаказПоставщикуТовары.Ссылка.Дата КАК ДатаОперации,
	             |	ЗаказПоставщикуТовары.Ссылка.Валюта КАК ВалютаДокумента,
	             |	ЗаказПоставщикуТовары.Ссылка КАК ЗаказПоставщику
	             |ИЗ
	             |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	             |ГДЕ
	             |	ЗаказПоставщикуТовары.Ссылка.Проведен
	             |	И ВЫБОР
	             |			КОГДА ЗаказПоставщикуТовары.АУ_ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	             |				ТОГДА ЗаказПоставщикуТовары.Ссылка.ДокументОснование
	             |			ИНАЧЕ ЗаказПоставщикуТовары.АУ_ЗаказКлиента
	             |		КОНЕЦ В (&Заказы)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ВЫБОР
	             |		КОГДА ЗаказПоставщикуТовары.АУ_ЗаказКлиента = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	             |			ТОГДА ЗаказПоставщикуТовары.Ссылка.ДокументОснование
	             |		ИНАЧЕ ЗаказПоставщикуТовары.АУ_ЗаказКлиента
	             |	КОНЕЦ,
	             |	ЗаказПоставщикуТовары.Ссылка.Контрагент,
	             |	ЗаказПоставщикуТовары.Ссылка,
				 |	ЗаказПоставщикуТовары.Ссылка.СуммаДокумента,
	             |	ЗаказПоставщикуТовары.Ссылка.Дата,
	             |	ЗаказПоставщикуТовары.Ссылка.Валюта,
	             |	ЗаказПоставщикуТовары.Ссылка";
	Запрос.УстановитьПараметр("Заказы",ТЗЗаказов.ВыгрузитьКолонку("Заказ"));
	ТЗЗаказовПоставщикам=Запрос.Выполнить().Выгрузить();
	
	Для каждого стрТЗ Из ТЗЗаказовПоставщикам Цикл
		
		Если ЗначениеЗаполнено(Заказ) Тогда
			Если стрТЗ.Заказ<>Заказ Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока=ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,стрТЗ);
		
		НоваяСтрока.СуммаЗаказаПоставщикуРубли=РаботаСКурсамиВалют.ПересчитатьВВалюту(стрТЗ.СуммаЗаказаПоставщику,стрТЗ.ВалютаДокумента,Рубли,стрТЗ.ДатаОперации);
		НоваяСтрока.ЗадолженностьВРублях=НоваяСтрока.СуммаЗаказаПоставщикуРубли;
		НоваяСтрока.ЗадолженностьВВалютеВзаиморасчетов=НоваяСтрока.СуммаЗаказаПоставщику;
		
	КонецЦикла;
	
	//3.  приход денег по заказам покупателей
	Запрос.Текст="ВЫБРАТЬ
	             |	СУММА(ВЫБОР
	             |			КОГДА ДенежныеСредстваБезналичные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	             |				ТОГДА ДенежныеСредстваБезналичные.Сумма
	             |			ИНАЧЕ 0
	             |		КОНЕЦ) КАК СуммаПриходаДенег,
	             |	СУММА(ВЫБОР
	             |			КОГДА ДенежныеСредстваБезналичные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	             |				ТОГДА ДенежныеСредстваБезналичные.Сумма
	             |			ИНАЧЕ 0
	             |		КОНЕЦ) КАК СуммаРасходаДенег,
	             |	ДенежныеСредстваБезналичные.ОбъектРасчетов.Объект КАК Заказ,
	             |	ДенежныеСредстваБезналичные.Регистратор.Контрагент КАК Контрагент,
	             |	ДенежныеСредстваБезналичные.Регистратор КАК ДокументОперации,
	             |	СУММА(ВЫБОР
	             |			КОГДА ДенежныеСредстваБезналичные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	             |				ТОГДА ДенежныеСредстваБезналичные.Сумма
	             |			ИНАЧЕ -ДенежныеСредстваБезналичные.Сумма
	             |		КОНЕЦ) КАК СуммаДокумента,
	             |	СУММА(ВЫБОР
	             |			КОГДА ДенежныеСредстваБезналичные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	             |				ТОГДА ДенежныеСредстваБезналичные.СуммаРегл
	             |			ИНАЧЕ -ДенежныеСредстваБезналичные.СуммаРегл
	             |		КОНЕЦ) КАК СуммаОперации,
	             |	ДенежныеСредстваБезналичные.Период КАК ДатаОперации,
	             |	ДенежныеСредстваБезналичные.Регистратор.Валюта КАК ВалютаДокумента,
				 |	ЕСТЬNULL(ДенежныеСредстваБезналичные.Регистратор.АУ_ФактическийКурсВалюты,0) КАК АУ_ФактическийКурсВалюты
	             |ИЗ
	             |	РегистрНакопления.ДенежныеСредстваБезналичные КАК ДенежныеСредстваБезналичные
	             |ГДЕ
	             |	ДенежныеСредстваБезналичные.ОбъектРасчетов.Объект В(&Заказы)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ДенежныеСредстваБезналичные.Регистратор,
	             |	ДенежныеСредстваБезналичные.Регистратор.Контрагент,
	             |	ДенежныеСредстваБезналичные.ОбъектРасчетов.Объект,
	             |	ДенежныеСредстваБезналичные.Период,
				 |	ЕСТЬNULL(ДенежныеСредстваБезналичные.Регистратор.АУ_ФактическийКурсВалюты,0),
	             |	ДенежныеСредстваБезналичные.Регистратор.Валюта";

	ТЗДеньги=Запрос.Выполнить().Выгрузить();
	
	Для каждого стрТЗ Из ТЗДеньги Цикл
		
		Если ЗначениеЗаполнено(Заказ) Тогда
			Если стрТЗ.Заказ<>Заказ Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока=ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,стрТЗ);
		
		Если стрТЗ.АУ_ФактическийКурсВалюты=0 Тогда
			НоваяСтрока.СуммаОперации=РаботаСКурсамиВалют.ПересчитатьВВалюту(стрТЗ.СуммаОперации,стрТЗ.ВалютаДокумента,Рубли,стрТЗ.ДатаОперации);
		Иначе
			НоваяСтрока.СуммаОперации=стрТЗ.СуммаОперации*стрТЗ.АУ_ФактическийКурсВалюты;
		КонецЕсли;
		НоваяСтрока.ЗадолженностьЗаказчика=-НоваяСтрока.СуммаОперации;
		
	КонецЦикла;
	
	//4. расход денег по заказам поставщиков
	Запрос.УстановитьПараметр("ЗаказыПоставщиков",ТЗЗаказовПоставщикам.ВыгрузитьКолонку("ЗаказПоставщику"));
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка КАК ЗаявкаНаРасход,
	             |	ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование КАК ЗаказПоставщику
	             |ПОМЕСТИТЬ ВТЗаказыПоставщикуПоЗаявкамНаРасход
	             |ИЗ
	             |	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	             |ГДЕ
	             |	ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование В(&ЗаказыПоставщиков)
	             |
	             |ОБЪЕДИНИТЬ
	             |
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка,
	             |	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов.Объект
	             |ИЗ
	             |	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа
	             |ГДЕ
	             |	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов.Объект В(&ЗаказыПоставщиков)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	РасчетыСПоставщиками.Период КАК ДатаОперации,
	             |	РасчетыСПоставщиками.Регистратор КАК ДокументОперации,
	             |	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	             |	СУММА(РасчетыСПоставщиками.Сумма) КАК СуммаДокумента,
	             |	СУММА(-РасчетыСПоставщиками.СуммаРегл) КАК СуммаОперации,
	             |	СУММА(РасчетыСПоставщиками.Сумма) КАК СуммаРасходаДенег,
	             |	РасчетыСПоставщиками.Валюта КАК ВалютаДокумента,
	             |	РасчетыСПоставщиками.ОбъектРасчетов.Объект КАК ЗаказПоставщику,
	             |	ВТЗаказыПоставщикуПоЗаявкамНаРасход.ЗаказПоставщику КАК ЗаказПоставщикуИзЗаявкиНаРасход,
	             |	ВТЗаказыПоставщикуПоЗаявкамНаРасход.ЗаявкаНаРасход КАК ЗаявкаНаРасход,
	             |	СУММА(РасчетыСПоставщиками.СуммаРегл) КАК СуммаРегл,
	             |	РасчетыСПоставщиками.ВалютаДокумента КАК ВалютаОперации,
				 |	ЕСТЬNULL(РасчетыСПоставщиками.Регистратор.АУ_ФактическийКурсВалюты,0) КАК АУ_ФактическийКурсВалюты
	             |ИЗ
	             |	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаказыПоставщикуПоЗаявкамНаРасход КАК ВТЗаказыПоставщикуПоЗаявкамНаРасход
	             |		ПО РасчетыСПоставщиками.ЗаявкаНаРасходованиеДенежныхСредств = ВТЗаказыПоставщикуПоЗаявкамНаРасход.ЗаявкаНаРасход
	             |ГДЕ
	             |	(РасчетыСПоставщиками.ОбъектРасчетов.Объект В (&ЗаказыПоставщиков)
	             |			ИЛИ ВТЗаказыПоставщикуПоЗаявкамНаРасход.ЗаказПоставщику В (&ЗаказыПоставщиков))
	             |	И РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	             |	И РасчетыСПоставщиками.Сумма <> 0
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	РасчетыСПоставщиками.Регистратор,
	             |	РасчетыСПоставщиками.Валюта,
	             |	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Контрагент,
	             |	РасчетыСПоставщиками.ОбъектРасчетов.Объект,
	             |	ВТЗаказыПоставщикуПоЗаявкамНаРасход.ЗаказПоставщику,
	             |	РасчетыСПоставщиками.Период,
	             |	ВТЗаказыПоставщикуПоЗаявкамНаРасход.ЗаявкаНаРасход,
	             |	РасчетыСПоставщиками.ВалютаДокумента,
				 |	ЕСТЬNULL(РасчетыСПоставщиками.Регистратор.АУ_ФактическийКурсВалюты,0)
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ
	             |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ДатаПроведенияБанком,
	             |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка,
	             |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Контрагент,
	             |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма,
	             |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма,
	             |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма,
	             |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта,
	             |	NULL,
	             |	ВТЗаказыПоставщикуПоЗаявкамНаРасход.ЗаказПоставщику,
	             |	ВТЗаказыПоставщикуПоЗаявкамНаРасход.ЗаявкаНаРасход,
	             |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма,
	             |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Валюта,
				 |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.АУ_ФактическийКурсВалюты КАК АУ_ФактическийКурсВалюты
	             |ИЗ
	             |	Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказыПоставщикуПоЗаявкамНаРасход КАК ВТЗаказыПоставщикуПоЗаявкамНаРасход
	             |		ПО (СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ЗаявкаНаРасходованиеДенежныхСредств = ВТЗаказыПоставщикуПоЗаявкамНаРасход.ЗаявкаНаРасход
	             |				ИЛИ СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.ЗаявкаНаРасходованиеДенежныхСредств = ВТЗаказыПоставщикуПоЗаявкамНаРасход.ЗаявкаНаРасход)
	             |ГДЕ
	             |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
	             |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ПроведеноБанком
	             |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств)";

	
	ТЗДеньги=Запрос.Выполнить().Выгрузить();
	
	ТЗРаспределения=Новый ТаблицаЗначений;
	ТЗРаспределения.Колонки.Добавить("Заказ");
	ТЗРаспределения.Колонки.Добавить("Сумма");
		
	Для каждого стрТЗ Из ТЗДеньги Цикл
		
		Если ЗначениеЗаполнено(стрТЗ.ЗаказПоставщику) И ТипЗнч(стрТЗ.ЗаказПоставщику)=Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ЗаказПоставщику=стрТЗ.ЗаказПоставщику;
		Иначе
			
			стрТЗ.СуммаРасходаДенег=0;
			стрТЗ.СуммаОперации=0;
			ЗаказПоставщику=стрТЗ.ЗаказПоставщикуИзЗаявкиНаРасход;
			
			Для каждого стрПлатеж Из стрТЗ.ЗаявкаНаРасход.РасшифровкаПлатежа Цикл
				
				Если стрПлатеж.ОбъектРасчетов.Объект=ЗаказПоставщику Тогда
					стрТЗ.СуммаРасходаДенег=стрТЗ.СуммаРасходаДенег+стрПлатеж.СуммаВзаиморасчетов;
					стрТЗ.СуммаОперации=стрТЗ.СуммаОперации-стрПлатеж.Сумма;
				КонецЕсли;
				
			КонецЦикла;
			
			Если стрТЗ.СуммаОперации=0 Тогда
				
				Если стрТЗ.ЗаявкаНаРасход.ДокументОснование=ЗаказПоставщику Тогда
					стрТЗ.СуммаРасходаДенег=стрТЗ.СуммаРасходаДенег+стрТЗ.ЗаявкаНаРасход.СуммаДокумента;
					стрТЗ.СуммаОперации=стрТЗ.СуммаОперации-стрТЗ.ЗаявкаНаРасход.СуммаДокумента;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЗаказПоставщику) Тогда
			Продолжить;
		КонецЕсли;
		
		ТЗРаспределения.Очистить();
		
		Для каждого стрТовары Из ЗаказПоставщику.Товары Цикл
			
			Если ЗначениеЗаполнено(стрТовары.АУ_ЗаказКлиента) Тогда
				
				НоваяСтрока=ТЗРаспределения.Добавить();
				НоваяСтрока.Заказ=стрТовары.АУ_ЗаказКлиента;
				НоваяСтрока.Сумма=стрТовары.СуммаСНДС;
				
			Иначе
				
				НоваяСтрока=ТЗРаспределения.Добавить();
				НоваяСтрока.Заказ=ЗаказПоставщику.ДокументОснование;
				НоваяСтрока.Сумма=стрТовары.СуммаСНДС;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТЗРаспределения.Свернуть("Заказ","Сумма");
		Для каждого стрРаспределение Из ТЗРаспределения Цикл
			
			Если ЗначениеЗаполнено(Заказ) Тогда
				Если стрРаспределение.Заказ<>Заказ Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(стрРаспределение.Заказ) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока=ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,стрТЗ);
			НоваяСтрока.Заказ=стрРаспределение.Заказ;
			НоваяСтрока.ЗаказПоставщику=ЗаказПоставщику;
			НоваяСтрока.СуммаРасходаДенег=Окр(НоваяСтрока.СуммаРасходаДенег*стрРаспределение.Сумма/ТЗРаспределения.Итог("Сумма"),2);
			НоваяСтрока.СуммаОперации=Окр(НоваяСтрока.СуммаОперации*стрРаспределение.Сумма/ТЗРаспределения.Итог("Сумма"),2);
			Если стрТЗ.АУ_ФактическийКурсВалюты=0 Тогда
				НоваяСтрока.СуммаРасходаДенегРубли=РаботаСКурсамиВалют.ПересчитатьВВалюту(НоваяСтрока.СуммаРасходаДенег,стрТЗ.ВалютаДокумента,Рубли,стрТЗ.ДатаОперации);
			Иначе
				НоваяСтрока.СуммаРасходаДенегРубли=НоваяСтрока.СуммаРасходаДенег*стрТЗ.АУ_ФактическийКурсВалюты;
			КонецЕсли;
			НоваяСтрока.ЗадолженностьВРублях=-НоваяСтрока.СуммаРасходаДенегРубли;
			НоваяСтрока.ЗадолженностьВВалютеВзаиморасчетов=-НоваяСтрока.СуммаРасходаДенег;
			
			Если стрТЗ.ВалютаОперации<>Рубли Тогда
				Если стрТЗ.АУ_ФактическийКурсВалюты=0 Тогда
					НоваяСтрока.СуммаОперации=-РаботаСКурсамиВалют.ПересчитатьВВалюту(стрТЗ.СуммаОперации,стрТЗ.ВалютаДокумента,Рубли,стрТЗ.ДатаОперации);
				Иначе
					НоваяСтрока.СуммаОперации=-стрТЗ.СуммаОперации*стрТЗ.АУ_ФактическийКурсВалюты;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//расставляем приоритеты
	ТекПриоритет=0;
	ТЗ.Сортировать("Заказ,ДатаОперации");
	Для каждого стрТЗ Из ТЗ Цикл
		
		Если ТипЗнч(стрТЗ.ДокументОперации)=Тип("ДокументСсылка.ЗаказКлиента") Тогда
			стрТЗ.Приоритет=10;
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(стрТЗ.ДокументОперации)=Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда
			стрТЗ.Приоритет=20;
			Продолжить;
		КонецЕсли;
		
		ТекПриоритет=ТекПриоритет+100;
		
		Если ТипЗнч(стрТЗ.ДокументОперации)=Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			стрТЗ.Приоритет=ТекПриоритет;
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого стрТЗ Из ТЗ Цикл
		
		Если ТипЗнч(стрТЗ.ДокументОперации)=Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда
			
			НайденныеСтроки=ТЗ.НайтиСтроки(Новый Структура("Заказ,ЗаказПоставщику",стрТЗ.Заказ,стрТЗ.ЗаказПоставщику));
			Для каждого стр Из НайденныеСтроки Цикл
				
				Если ЗначениеЗаполнено(стр.Приоритет) Тогда
					стрТЗ.Приоритет=стр.Приоритет+1;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если стрТЗ.Приоритет=0 Тогда
				стрТЗ.Приоритет=1000;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ВнешнийНаборДанных = Новый Структура("ДанныеПоЗаказу", ТЗ);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры
